export default {
  projections: {
    БольнЛистE: {
      номерДок: {
        __caption__: 'Номер документа'
      },
      датаНачБол: {
        __caption__: 'Дата начала больничного'
      },
      датаОконБол: {
        __caption__: 'Дата окончания больничного'
      },
      колДней: {
        __caption__: 'Количество дней'
      },
      первичный: {
        __caption__: 'Первичный'
      },
      повторный: {
        __caption__: 'Повторный'
      },
      причина: {
        __caption__: 'Причина '
      },
      заСчетРаб: {
        __caption__: 'За счет работ'
      },
      заСчетФСС: {
        __caption__: 'За счет ФСС'
      },
      всегоНачисл: {
        __caption__: 'Всего начислений'
      }
    }
  },
  validations: {
    всегоНачисл: {
      __caption__: 'Всего начислений'
    },
    датаНачБол: {
      __caption__: 'Дата начала больничного'
    },
    датаОконБол: {
      __caption__: 'Дата окончания больничного'
    },
    заСчетРаб: {
      __caption__: 'За счет работ'
    },
    заСчетФСС: {
      __caption__: 'За счет ФСС'
    },
    колДней: {
      __caption__: 'Количество дней'
    },
    номерДок: {
      __caption__: 'Номер документа'
    },
    первичный: {
      __caption__: 'Первичный'
    },
    повторный: {
      __caption__: 'Повторный'
    },
    причина: {
      __caption__: 'Причина '
    },
    расчетныйЛист: {
      __caption__: 'расчетныйЛист'
    }
  }
};
