export default {
  projections: {
    УчетРабочВрE: {
      дата: {
        __caption__: 'Дата'
      },
      отрабЧасы: {
        __caption__: 'Отработанные часы'
      },
      типОтр: {
        __caption__: 'Тип отработки'
      },
      сотрудники: {
        __caption__: 'Сотрудник'
      }
    },
    УчетРабочВрL: {
      дата: {
        __caption__: 'Дата'
      },
      отрабЧасы: {
        __caption__: 'Отработанные часы'
      },
      типОтр: {
        __caption__: 'Тип отработки'
      },
      сотрудники: {
        __caption__: 'Сотрудник'
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    отрабЧасы: {
      __caption__: 'Отработанные часы'
    },
    типОтр: {
      __caption__: 'Тип отработки'
    },
    сотрудники: {
      __caption__: 'Сотрудник'
    }
  }
};
