export default {
  projections: {
    ОтпускE: {
      номерДок: {
        __caption__: 'Номер документа'
      },
      датаНачОтп: {
        __caption__: 'Дата начала отпуска'
      },
      датаОконОтп: {
        __caption__: 'Дата окончания отпуска'
      },
      колДней: {
        __caption__: 'Количество дней'
      }
    }
  },
  validations: {
    датаНачОтп: {
      __caption__: 'Дата начала отпуска'
    },
    датаОконОтп: {
      __caption__: 'Дата окончания отпуска'
    },
    колДней: {
      __caption__: 'Количество дней'
    },
    номерДок: {
      __caption__: 'Номер документа'
    },
    расчетныйЛист: {
      __caption__: 'расчетныйЛист'
    }
  }
};
