export default {
  projections: {
    ОрганизацииE: {
      код: {
        __caption__: 'Код'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      иНН: {
        __caption__: 'ИНН'
      },
      кПП: {
        __caption__: 'КПП'
      },
      оГРН: {
        __caption__: 'ОГРН'
      },
      адрес: {
        __caption__: 'Адрес'
      }
    },
    ОрганизацииL: {
      код: {
        __caption__: 'Код'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      иНН: {
        __caption__: 'ИНН'
      },
      кПП: {
        __caption__: 'КПП'
      },
      оГРН: {
        __caption__: 'ОГРН'
      },
      адрес: {
        __caption__: 'Адрес'
      }
    }
  },
  validations: {
    адрес: {
      __caption__: 'Адрес'
    },
    иНН: {
      __caption__: 'ИНН'
    },
    код: {
      __caption__: 'Код'
    },
    кПП: {
      __caption__: 'КПП'
    },
    наименование: {
      __caption__: 'Наименование'
    },
    оГРН: {
      __caption__: 'ОГРН'
    }
  }
};
