export default {
  projections: {
    СотрудникиE: {
      код: {
        __caption__: 'Код'
      },
      фИО: {
        __caption__: 'ФИО'
      },
      рабТел: {
        __caption__: 'Рабочий телефон'
      },
      почта: {
        __caption__: 'Почта'
      },
      оклад: {
        __caption__: 'Оклад'
      },
      процСтавка: {
        __caption__: 'Процентная ставка'
      },
      должности: {
        __caption__: 'Должность'
      },
      отделы: {
        __caption__: 'Отдел'
      },
      организации: {
        __caption__: 'Организация'
      }
    },
    СотрудникиL: {
      код: {
        __caption__: 'Код'
      },
      фИО: {
        __caption__: 'ФИО'
      },
      рабТел: {
        __caption__: 'Рабочий телефон'
      },
      почта: {
        __caption__: 'Почта'
      },
      оклад: {
        __caption__: 'Оклад'
      },
      процСтавка: {
        __caption__: 'Процентная ставка'
      },
      должности: {
        __caption__: 'Должность'
      },
      отделы: {
        __caption__: 'Отдел'
      },
      организации: {
        __caption__: 'Организация'
      }
    }
  },
  validations: {
    код: {
      __caption__: 'Код'
    },
    оклад: {
      __caption__: 'Оклад'
    },
    почта: {
      __caption__: 'Почта'
    },
    процСтавка: {
      __caption__: 'Процентная ставка'
    },
    рабТел: {
      __caption__: 'Рабочий телефон'
    },
    фИО: {
      __caption__: 'ФИО'
    },
    должности: {
      __caption__: 'Должность'
    },
    организации: {
      __caption__: 'Организация'
    },
    отделы: {
      __caption__: 'Отдел'
    }
  }
};
