export default {
  projections: {
    РасчетныйЛистE: {
      номерДок: {
        __caption__: 'Номер документа'
      },
      датаНачПер: {
        __caption__: 'Дата начала периода'
      },
      датаОкончПер: {
        __caption__: 'Дата окончания периода'
      },
      общаяСумма: {
        __caption__: 'Общая сумма'
      },
      сотрудники: {
        __caption__: 'Сотрудник'
      },
      больнЛист: {
        __caption__: 'Больничный лист',
        номерДок: {
          __caption__: 'Номер документа'
        },
        датаНачБол: {
          __caption__: 'Дата начала больничного'
        },
        датаОконБол: {
          __caption__: 'Дата окончания больничного'
        },
        колДней: {
          __caption__: 'Количество дней'
        },
        первичный: {
          __caption__: 'Первичный'
        },
        повторный: {
          __caption__: 'Повторный'
        },
        причина: {
          __caption__: 'Причина '
        },
        заСчетРаб: {
          __caption__: 'За счет работ'
        },
        заСчетФСС: {
          __caption__: 'За счет ФСС'
        },
        всегоНачисл: {
          __caption__: 'Всего начислений'
        }
      },
      отпуск: {
        __caption__: 'Отпускной лист',
        номерДок: {
          __caption__: 'Номер документа'
        },
        датаНачОтп: {
          __caption__: 'Дата начала отпуска'
        },
        датаОконОтп: {
          __caption__: 'Дата окончания отпуска'
        },
        колДней: {
          __caption__: 'Количество дней'
        }
      },
      премии: {
        __caption__: 'Премия',
        критерий: {
          __caption__: 'Критерий'
        },
        сумма: {
          __caption__: 'Сумма'
        }
      },
      удержИВыч: {
        __caption__: 'Удержание и вычеты',
        название: {
          __caption__: 'Название'
        },
        сумма: {
          __caption__: 'Сумма'
        }
      }
    },
    РасчетныйЛистL: {
      номерДок: {
        __caption__: 'Номер документа'
      },
      датаНачПер: {
        __caption__: 'Дата начала периода'
      },
      датаОкончПер: {
        __caption__: 'Дата окончания периода'
      },
      общаяСумма: {
        __caption__: 'Общая сумма'
      },
      сотрудники: {
        __caption__: 'Сотрудник'
      },
      больнЛист: {
        __caption__: 'Больничный лист',
        номерДок: {
          __caption__: 'Номер документа'
        },
        датаНачБол: {
          __caption__: 'Дата начала больничного'
        },
        датаОконБол: {
          __caption__: 'Дата окончания больничного'
        },
        колДней: {
          __caption__: 'Количество дней'
        },
        первичный: {
          __caption__: 'Первичный'
        },
        повторный: {
          __caption__: 'Повторный'
        },
        причина: {
          __caption__: 'Причина '
        },
        заСчетРаб: {
          __caption__: 'За счет работ'
        },
        заСчетФСС: {
          __caption__: 'За счет ФСС'
        },
        всегоНачисл: {
          __caption__: 'Всего начислений'
        }
      },
      отпуск: {
        __caption__: 'Отпускной лист',
        номерДок: {
          __caption__: 'Номер документа'
        },
        датаНачОтп: {
          __caption__: 'Дата начала отпуска'
        },
        датаОконОтп: {
          __caption__: 'Дата окончания отпуска'
        },
        колДней: {
          __caption__: 'Количество дней'
        }
      },
      премии: {
        __caption__: 'Премия',
        критерий: {
          __caption__: 'Критерий'
        },
        сумма: {
          __caption__: 'Сумма'
        }
      },
      удержИВыч: {
        __caption__: 'Удержание и вычеты',
        название: {
          __caption__: 'Название'
        },
        сумма: {
          __caption__: 'Сумма'
        }
      }
    }
  },
  validations: {
    датаНачПер: {
      __caption__: 'Дата начала периода'
    },
    датаОкончПер: {
      __caption__: 'Дата окончания периода'
    },
    номерДок: {
      __caption__: 'Номер документа'
    },
    общаяСумма: {
      __caption__: 'Общая сумма'
    },
    сотрудники: {
      __caption__: 'Сотрудник'
    },
    больнЛист: {
      __caption__: 'Больничный лист'
    },
    удержИВыч: {
      __caption__: 'Удержание и вычеты'
    },
    отпуск: {
      __caption__: 'Отпускной лист'
    },
    премии: {
      __caption__: 'Премия'
    }
  }
};
